import numpy as np
# напишем функцию get_b, которая на вход принимает матрицу Х и вектор у и высчитывает по ним значение вектора b
def get_b(X, y):
    # с помощью np.transpose() транспонируем массив Х 
    x_transp = np.transpose(X)
    # вычисляем скалярное произведение x_transp и у
    scalar_product_1 = np.dot(x_transp, y)
    # вычисляем произведение матриц x_transp и Х
    scalar_product_2 = np.matmul(x_transp, X)
    # с помощью np.linalg.inv() берем обратную матрицу 
    reverse_matrix = np.linalg.inv(scalar_product_2)
    # вычисляем итоговое скалярное произвдение и получаем значение вектора b
    b = np.dot(reverse_matrix, scalar_product_1)
    return b


X = np.array([
    [34.98, 95.49, 72.92, 46.52, 83.85, 96.29, 26.44, 71.55, 4.82, 76.71],
    [20.15, 1.89, -26.61, -36.19, 27.71, -20.6, -20.73, 23.95, -28.55, -48.78],
    [0.381, 3.597, -1.634, 16.979, 10.622, 19.857, -8.045, -0.557, 9.775, 10.587],
    [0.4, -0.2, 0, 1.2, 0.1, -0.5, -1, -2.4, 0.5, 0.9],
    [-971.2, -951.6, -951.1, -978.2, -979.7, -932.7, -986.9, -963.3, -900.6, -923.6],
    [-616, -823, -942, -631, -946, -674, -698, -728, -810, -731],
    [11.33, 14.109, 13.702, -0.5, 14.7, 14.845, 1.063, -9.091, 17.277, 0.701],
    [55.73, 45.37, 14.75, 15.33, 63.15, 71.65, 71, 47.08, 36.42, 23.73],
    [80, 56, 53, 35, 39, 12, 61, 71, 25, 3],
    [19, -4, 9, 9, 5, 14, 2, 4, 19, 8]
])

y = np.array([2.084, -3.273, 4.624, 1.467, 0.105, 5.994, -0.417, 4.177, 5.806, 6.222])

print(get_b(X, y))